beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_ble_manager.c
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("BLE_MANAGER: Fast advertising.");
            break;

        case BLE_ADV_EVT_IDLE:
            break;

        default:
            break;
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_DISCONNECTED:
            isCusStatNotificationEnabled = false;
            isCusSensNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: false");
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: false");
            NRF_LOG_INFO("BLE_MANAGER: Disconnected.");
            break;

        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("BLE_MANAGER: Connected.");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("BLE_MANAGER: PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            isCusStatNotificationEnabled = false;
            isCusSensNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: false");
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: false");
            NRF_LOG_DEBUG("BLE_MANAGER: GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            isCusStatNotificationEnabled = false;
            isCusSensNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: false");
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: false");
            NRF_LOG_DEBUG("BLE_MANAGER: GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/


/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_cus_stat_evt(cus_stat_t * p_cus_service, cus_stat_evt_t * p_evt)
{
    uint32_t err_code;
    static ble_gatts_value_t gatts_value;
    static uint8_t data_buffer[sizeof(device_status_data)];
        
    switch(p_evt->evt_type)
    {
        case CUS_STAT_EVT_NOTIFICATION_ENABLED:
            isCusStatNotificationEnabled = true;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: true");
            break;

        case CUS_STAT_EVT_NOTIFICATION_DISABLED:
            isCusStatNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: false");
            break;

        case CUS_STAT_EVT_CONNECTED :
            break;

        case CUS_STAT_EVT_DISCONNECTED:
            isCusStatNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusStatNotificationEnabled: false");
            break;

        case CUS_STAT_EVT_WRITE:

            //Allocate memory for "gatts_value" variable:
            memset(&gatts_value, 0, sizeof(gatts_value));
            gatts_value.offset  = 0;
            gatts_value.len     = sizeof(device_status_data);
            gatts_value.p_value = (uint8_t*) &data_buffer;

