beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_ble_manager.c
            //If the STAT characteristic notification is enabled, then the STAT characteristic changed by the NordicSoftdevice is valid:
            if(bleGetCusStatNotificationFlag())
            {               
                //Get the last STAT characteristic written by the phone app and store on "data_buffer":
                err_code = sd_ble_gatts_value_get(p_cus_service->conn_handle, p_cus_service->custom_value_handles.value_handle, &gatts_value);
                APP_ERROR_CHECK(err_code);

                //Store the commandFromPhoneAux = command of the STAT characteristic written by the phone:
                bool commandFromPhoneAux = (bool) data_buffer[0];
                
                //The command of the STAT characteristic is analysed only if is different from the command in device status data:
                if(commandFromPhoneAux != deviceStatus_getStructData_commandFromPhone())
                {                    
                    //If the command from phone app is true:
                    if(commandFromPhoneAux){
                        //And if the detection system is not measuring, then start detection system task: 
                        if(!deviceStatus_getStructData_isDataOnFlash())
                        {
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic is gonna be stored in the device status data.");
                     
                            //Update the status data (now the nrf52 is commanded to start the detection task):
                            deviceStatus_saveStructData_commandFromPhone(true);
                            NRF_LOG_INFO("BLE_MANAGER: commandFromPhone = %d.", deviceStatus_getStructData_commandFromPhone());

                            //Start the detection system timers:
                            NRF_LOG_INFO("BLE_MANAGER: Detection System Task Starts.");
                            timerDetectionSystem_Start();
                            secondsStart();
                            hundredMillisStart();
                            
                            //Update the device status data (now it's measuring and there is data on flash):
                            deviceStatus_saveStructData_isMeasuring(true);
                            NRF_LOG_INFO("BLE_MANAGER: isMeasuring = %d.", deviceStatus_getStructData_isMeasuring());
                            deviceStatus_saveStructData_isDataOnFlash(true);
                            deviceStatus_saveStructData_fileName(data_buffer[3], data_buffer[4], data_buffer[5], data_buffer[6], data_buffer[7], data_buffer[8]);
                            NRF_LOG_INFO("BLE_MANAGER: isDataOnFlash = %d.", deviceStatus_getStructData_isDataOnFlash());
                            NRF_LOG_INFO("BLE_MANAGER: fileName_year = %d.", deviceStatus_getStructData().fileName_year);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_month = %d.", deviceStatus_getStructData().fileName_month);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_day = %d.", deviceStatus_getStructData().fileName_day);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_hrs = %d.", deviceStatus_getStructData().fileName_hrs);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_mins = %d.", deviceStatus_getStructData().fileName_mins);
                            NRF_LOG_INFO("BLE_MANAGER: fileName_secs = %d.", deviceStatus_getStructData().fileName_secs);
                            
                            //Change the "data_buffer" to update STAT characteristic:
                            data_buffer[0] = deviceStatus_getStructData_commandFromPhone();
                            data_buffer[1] = deviceStatus_getStructData_isMeasuring();
                            data_buffer[2] = deviceStatus_getStructData_isDataOnFlash();
                            data_buffer[3] = deviceStatus_getStructData().fileName_year;
                            data_buffer[4] = deviceStatus_getStructData().fileName_month;
                            data_buffer[5] = deviceStatus_getStructData().fileName_day;
                            data_buffer[6] = deviceStatus_getStructData().fileName_hrs;
                            data_buffer[7] = deviceStatus_getStructData().fileName_mins;
                            data_buffer[8] = deviceStatus_getStructData().fileName_secs;

                            //Send a notification back to the phone app of the STAT characteristic written (stored on "data_buffer"):
                            uint32_t err_code = cus_stat_custom_value_update(p_cus_service, data_buffer);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("BLE_MANAGER: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());
                        }
                        //But if the detection system is measuring, then print log info:
                        else
                        {
                            NRF_LOG_INFO("BLE_MANAGER: The Detection System is already measuring, so you have to wait until detection system task stops.");
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic will not be stored in the device status data.");
                        }
                    }
                    //If the command from phone app is false:
                    else
                    {
                        //And if the detection system is measuring, then the main will stop the detection system task soon:
                        if(deviceStatus_getStructData_isDataOnFlash())
                        {
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic is gonna be stored in the device status data.");
                     
