beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_ble_manager.c
                            //Update the status data (now the nrf52 is commanded to stop the detection task):
                            deviceStatus_saveStructData_commandFromPhone(false);
                            NRF_LOG_INFO("BLE_MANAGER: commandFromPhone = %d.", deviceStatus_getStructData_commandFromPhone());

                            //Change the "data_buffer" to update STAT characteristic:
                            data_buffer[0] = deviceStatus_getStructData_commandFromPhone();
                            data_buffer[1] = deviceStatus_getStructData_isMeasuring();

                            //Send a notification back to the phone app of the STAT characteristic written (stored on "data_buffer"):
                            uint32_t err_code = cus_stat_custom_value_update(p_cus_service, data_buffer);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("BLE_MANAGER: Send notification of the STAT characteristic. commandFromPhone = %d. isMeasuring = %d. isDataOnFlash = %d", deviceStatus_getStructData_commandFromPhone(), deviceStatus_getStructData_isMeasuring(), deviceStatus_getStructData_isDataOnFlash());
                            NRF_LOG_INFO("BLE_MANAGER: Wait until the detection system task stops.");
                        }
                        //But if the detection system is not measuring, then print log info:
                        else
                        {
                            NRF_LOG_INFO("BLE_MANAGER: The Detection System is not measuring, so the command from phone was not necessary");
                            NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic will not be stored in the device status data.");
                        }
                    }
                }
                //If the command of the STAT characteristic sent by the phone is the same as the device status command, then print log info:
                else
                {
                    NRF_LOG_INFO("BLE_MANAGER: The ble command sent by the phone is the same as the stored. commandFromPhone = %d", deviceStatus_getStructData_commandFromPhone());
                }

            }
            //If the STAT characteristic notification is disabled, then the STAT characteristic changed by the NordicSoftdevice is not valid:
            else
            {
                NRF_LOG_INFO("BLE_MANAGER: Write to STAT characteristic is not valid when notification is disabled.");

                //Update and notify the STAT characteristic (must be the status data stored):
                device_status_data dataCusStat = deviceStatus_getStructData();
                data_buffer[0] = dataCusStat.commandFromPhone;
                data_buffer[1] = dataCusStat.isMeasuring;
                data_buffer[2] = dataCusStat.isDataOnFlash;
                data_buffer[3] = dataCusStat.fileName_year;
                data_buffer[4] = dataCusStat.fileName_month;
                data_buffer[5] = dataCusStat.fileName_day;
                data_buffer[6] = dataCusStat.fileName_hrs;
                data_buffer[7] = dataCusStat.fileName_mins;
                data_buffer[8] = dataCusStat.fileName_secs;
                err_code = sd_ble_gatts_value_set(p_cus_service->conn_handle, p_cus_service->custom_value_handles.value_handle, &gatts_value);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("BLE_MANAGER: The STAT characteristic is the same as the device status data.");
            }

            break;

        default:
              // No implementation needed.
              break;
    }
}


/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_cus_sens_evt(cus_sens_t * p_cus_service, cus_sens_evt_t * p_evt)
{
    uint32_t err_code;
    switch(p_evt->evt_type)
    {
        case CUS_SENS_EVT_NOTIFICATION_ENABLED:
            isCusSensNotificationEnabled = true;
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: true");
            break;

        case CUS_SENS_EVT_NOTIFICATION_DISABLED:
            isCusSensNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: false");
            break;

        case CUS_SENS_EVT_CONNECTED :
            break;

        case CUS_SENS_EVT_DISCONNECTED:
            isCusSensNotificationEnabled = false;
            NRF_LOG_INFO("BLE_MANAGER: isCusSensNotificationEnabled: false");
            break;

        default:
              // No implementation needed.
              break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

