beorostica/portable_dna_amplifier_detector/main_code_nrf52840/custom_libraries/custom_ble_manager.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing services that will be used by the application.
 */
void services_init(void)
{
    ret_code_t         err_code;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Add code to initialize the services used by the application.
       ble_xxs_init_t                     xxs_init;
       ble_yys_init_t                     yys_init;

       // Initialize XXX Service.
       memset(&xxs_init, 0, sizeof(xxs_init));

       xxs_init.evt_handler                = NULL;
       xxs_init.is_xxx_notify_supported    = true;
       xxs_init.ble_xx_initial_value.level = 100;

       err_code = ble_bas_init(&m_xxs, &xxs_init);
       APP_ERROR_CHECK(err_code);

       // Initialize YYY Service.
       memset(&yys_init, 0, sizeof(yys_init));
       yys_init.evt_handler                  = on_yys_evt;
       yys_init.ble_yy_initial_value.counter = 0;

       err_code = ble_yy_service_init(&yys_init, &yy_init);
       APP_ERROR_CHECK(err_code);
     */

    //////////////////////////////////////////////////////////////
    //CUS STAT service variable:
    cus_stat_init_t  cus_stat_init;

    //Initialize CUS Service init structure to zero.
    memset(&cus_stat_init, 0, sizeof(cus_stat_init));

    //Sets the write and read permissions to the characteristic value attribute to open, i.e. the peer is allowed to write/read the value without encrypting the link first.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_stat_init.custom_value_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_stat_init.custom_value_char_attr_md.write_perm);

    // Set the cus event handler
    cus_stat_init.evt_handler = on_cus_stat_evt;

    err_code = cus_stat_ble_init(&m_cus_stat, &cus_stat_init);
    APP_ERROR_CHECK(err_code);

    //////////////////////////////////////////////////////////////
    //CUS SENS service variable:
    cus_sens_init_t  cus_sens_init;

    //Initialize CUS Service init structure to zero.
    memset(&cus_sens_init, 0, sizeof(cus_sens_init));

    //The write and read permissions to the characteristic value attribute are disabled:
    //BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_sens_init.custom_value_char_attr_md.read_perm);
    //BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_sens_init.custom_value_char_attr_md.write_perm);

    // Set the cus event handler
    cus_sens_init.evt_handler = on_cus_sens_evt;

    err_code = cus_sens_ble_init(&m_cus_sens, &cus_sens_init);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for initializing the Connection Parameters module.
 */
void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}




/**@brief Function for checking notification status.
 */
bool bleGetCusStatNotificationFlag(void)
{
    return isCusStatNotificationEnabled;
}

/**@brief Function for checking notification status.
 */
bool bleGetCusSensNotificationFlag(void)
{
    return isCusSensNotificationEnabled;
}

/**@brief Function for sending ble data.
 */
void bleCusStatSendData(device_status_data data)
{
    uint8_t *ptrData = (uint8_t*) &data;
    uint32_t err_code = cus_stat_custom_value_update(&m_cus_stat, ptrData);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for sending ble data.
 */
void bleCusSensSendData(detection_system_single_data data)
{
    uint8_t *ptrData = (uint8_t*) &data;
    uint32_t err_code = cus_sens_custom_value_update(&m_cus_sens, ptrData);
    APP_ERROR_CHECK(err_code);
}